In [1]:
#Import of necessary libraries to work
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

import pymysql
from sqlalchemy import create_engine
import getpass  # To get the password without showing the input
password = getpass.getpass()

········

In [2]:
connection_string = 'mysql+pymysql://root:' + password + '@localhost/self1'
engine = create_engine(connection_string)

In [3]:
query = '''SELECT ID, TypeOfSelfEmployment, BranchesSIC2008, PersonCharacteristics, Sex, Periods, SelfEmployedPersons_1, \
AveragePersonalIncome_2, AverageSelfEmployedIncome_4 \
FROM self_empl
;'''

data= pd.read_sql_query(query, engine)
data.head()

,ID,TypeOfSelfEmployment,BranchesSIC2008,PersonCharacteristics,Sex,Periods,SelfEmployedPersons_1,AveragePersonalIncome_2,AverageSelfEmployedIncome_4
0,4,2021380,T001081,T009002,T001038,2011JJ00,1093.1,38.8,29.39999962
1,5,2021380,T001081,T009002,T001038,2012JJ00,1106.2,38.1,28.20000076
2,6,2021380,T001081,T009002,T001038,2013JJ00,1120.2,37.9,27.79999924
3,7,2021380,T001081,T009002,T001038,2014JJ00,1149.7,39.1,28.89999962
4,8,2021380,T001081,T009002,T001038,2015JJ00,1180.0,39.8,29.89999962

In [4]:
data.shape

(459420, 9)

In [5]:
sum(data.duplicated())

0

In [6]:
df = data[['ID', 'TypeOfSelfEmployment', 'BranchesSIC2008', 'PersonCharacteristics', 'Sex', 'Periods', 'SelfEmployedPersons_1', 'AveragePersonalIncome_2', 'AverageSelfEmployedIncome_4']]

In [7]:
df

,ID,TypeOfSelfEmployment,BranchesSIC2008,PersonCharacteristics,Sex,Periods,SelfEmployedPersons_1,AveragePersonalIncome_2,AverageSelfEmployedIncome_4
0,4,2021380,T001081,T009002,T001038,2011JJ00,1093.1,38.8,29.39999962
1,5,2021380,T001081,T009002,T001038,2012JJ00,1106.2,38.1,28.20000076
2,6,2021380,T001081,T009002,T001038,2013JJ00,1120.2,37.9,27.79999924
3,7,2021380,T001081,T009002,T001038,2014JJ00,1149.7,39.1,28.89999962
4,8,2021380,T001081,T009002,T001038,2015JJ00,1180.0,39.8,29.89999962
...,...,...,...,...,...,...,...,...,...
459415,643183,2021410,999999,1021150,4000,2016JJ00,5.1,12.8,7.5
459416,643184,2021410,999999,1021150,4000,2017JJ00,5.0,13.7,7.900000095
459417,643185,2021410,999999,1021150,4000,2018JJ00,5.2,14,8.199999809
459418,643186,2021410,999999,1021150,4000,2019JJ00,3.5,15.1,10
459419,643187,2021410,999999,1021150,4000,2020JJ00,3.3,15,10

In [8]:
round(df.isna().sum()/len(df),4)*100

ID                             0.0
TypeOfSelfEmployment           0.0
BranchesSIC2008                0.0
PersonCharacteristics          0.0
Sex                            0.0
Periods                        0.0
SelfEmployedPersons_1          0.0
AveragePersonalIncome_2        0.0
AverageSelfEmployedIncome_4    0.0
dtype: float64

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 459420 entries, 0 to 459419
Data columns (total 9 columns):
 #   Column                       Non-Null Count   Dtype
---  ------                       --------------   -----
 0   ID                           459420 non-null  int64
 1   TypeOfSelfEmployment         459420 non-null  int64
 2   BranchesSIC2008              459420 non-null  object
 3   PersonCharacteristics        459420 non-null  object
 4   Sex                          459420 non-null  object
 5   Periods                      459420 non-null  object
 6   SelfEmployedPersons_1        459420 non-null  float64
 7   AveragePersonalIncome_2      459420 non-null  object
 8   AverageSelfEmployedIncome_4  459420 non-null  object
dtypes: float64(1), int64(2), object(6)
memory usage: 31.5+ MB

In [10]:
df = df.rename(columns = {'ID':'id', 'TypeOfSelfEmployment':'self_employment_type', 'BranchesSIC2008': 'branch',
                          'PersonCharacteristics': 'person_characteristics', 'Sex':'gender', 'Periods': 'period',
                          'SelfEmployedPersons_1':'self_empl_persons', 'AveragePersonalIncome_2':'avg_personal_income',
                          'AverageSelfEmployedIncome_4':'avg_self_empl_income'})

In [11]:
print(df.columns)

Index(['id', 'self_employment_type', 'branch', 'person_characteristics',
       'gender', 'period', 'self_empl_persons', 'avg_personal_income',
       'avg_self_empl_income'],
      dtype='object')

In [12]:
df['avg_personal_income'] = pd.to_numeric(df['avg_personal_income'], errors='coerce')
df['avg_self_empl_income'] = pd.to_numeric(df['avg_self_empl_income'], errors='coerce')

In [13]:
df.dtypes['avg_personal_income'], df.dtypes['avg_self_empl_income']

(dtype('float64'), dtype('float64'))

In [14]:
df['avg_self_empl_income'] = round(df['avg_self_empl_income'],1)
df.head(3)

,id,self_employment_type,branch,person_characteristics,gender,period,self_empl_persons,avg_personal_income,avg_self_empl_income
0,4,2021380,T001081,T009002,T001038,2011JJ00,1093.1,38.8,29.4
1,5,2021380,T001081,T009002,T001038,2012JJ00,1106.2,38.1,28.2
2,6,2021380,T001081,T009002,T001038,2013JJ00,1120.2,37.9,27.8

In [15]:
round(df.isna().sum()/len(df),4)*100

id                         0.00
self_employment_type       0.00
branch                     0.00
person_characteristics     0.00
gender                     0.00
period                     0.00
self_empl_persons          0.00
avg_personal_income       42.26
avg_self_empl_income      40.89
dtype: float64

In [16]:
df = df.dropna()
df = df.reset_index(drop=True)

In [17]:
round(df.isna().sum()/len(df),4)*100

id                        0.0
self_employment_type      0.0
branch                    0.0
person_characteristics    0.0
gender                    0.0
period                    0.0
self_empl_persons         0.0
avg_personal_income       0.0
avg_self_empl_income      0.0
dtype: float64

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 265288 entries, 0 to 265287
Data columns (total 9 columns):
 #   Column                  Non-Null Count   Dtype
---  ------                  --------------   -----
 0   id                      265288 non-null  int64
 1   self_employment_type    265288 non-null  int64
 2   branch                  265288 non-null  object
 3   person_characteristics  265288 non-null  object
 4   gender                  265288 non-null  object
 5   period                  265288 non-null  object
 6   self_empl_persons       265288 non-null  float64
 7   avg_personal_income     265288 non-null  float64
 8   avg_self_empl_income    265288 non-null  float64
dtypes: float64(3), int64(2), object(4)
memory usage: 18.2+ MB

In [19]:
#create/convert category groups type of self-employed persons
def CategoryGroupType(t):
    if t in [2021380, 2021430, 2021420, 2021400]:
        t = '1st_category_group'
    elif t in [2021396, 2021385]:
        t = '2nd_category_group'
    elif t in [2021390, 2021391, 2021392]:
        t = '3rd_category_group'
    elif t in [2021393, 2021394, 2021395]:
        t = '4th_category_group'
    elif t in [2021410]:
        t = '5th_category_group'
    return t


df['self_employment_type'] = list(map(CategoryGroupType, df['self_employment_type']))

In [20]:
df['self_employment_type'].value_counts()

1st_category_group    82149
3rd_category_group    70043
2nd_category_group    51430
4th_category_group    48477
5th_category_group    13189
Name: self_employment_type, dtype: int64

In [21]:
df['gender'].value_counts()

T001038    96514
3000       88523
4000       80251
Name: gender, dtype: int64

In [22]:
df['gender'] = df['gender'].str.replace(" ", "")
df['branch'] = df['branch'].str.replace(" ", "")
df['person_characteristics'] = df['person_characteristics'].str.replace(" ", "")

In [23]:
def Gender(g):
    if g == '3000':
        g = 'Male'
    elif g == 'T001038':
        g = np.NAN
    elif g == '4000':
        g = 'Female'
    return g    

df['gender'] = list(map(Gender, df['gender']))

In [24]:
df['gender'].value_counts()

Male      88523
Female    80251
Name: gender, dtype: int64

In [25]:
round(df.isna().sum()/len(df),4)*100

id                         0.00
self_employment_type       0.00
branch                     0.00
person_characteristics     0.00
gender                    36.38
period                     0.00
self_empl_persons          0.00
avg_personal_income        0.00
avg_self_empl_income       0.00
dtype: float64

In [26]:
df = df.dropna()
df = df.reset_index(drop=True)

In [27]:
df['period'].value_counts()

2019JJ00    18933
2018JJ00    18540
2017JJ00    18457
2016JJ00    18445
2015JJ00    18410
2014JJ00    18227
2012JJ00    18092
2011JJ00    18063
2013JJ00    13324
2020JJ00     8283
Name: period, dtype: int64

In [28]:
df['period'] = df['period'].str.replace('JJ00', '')

In [29]:
df['period'].value_counts()

2019    18933
2018    18540
2017    18457
2016    18445
2015    18410
2014    18227
2012    18092
2011    18063
2013    13324
2020     8283
Name: period, dtype: int64

In [30]:
df.head()

,id,self_employment_type,branch,person_characteristics,gender,period,self_empl_persons,avg_personal_income,avg_self_empl_income
0,18,1st_category_group,T001081,T009002,Male,2011,682.6,47.4,38.6
1,19,1st_category_group,T001081,T009002,Male,2012,692.5,46.3,37.1
2,20,1st_category_group,T001081,T009002,Male,2013,699.1,46.1,36.6
3,21,1st_category_group,T001081,T009002,Male,2014,717.2,47.5,37.9
4,22,1st_category_group,T001081,T009002,Male,2015,735.7,48.2,39.0

In [31]:
df['branch'].value_counts()

T001081    8976
300007     8635
300006     8039
300010     7943
300013     7931
354200     7612
403300     7540
300012     7370
300003     7082
300014     7078
422400     7051
410200     6712
389100     6594
350000     6474
435500     6277
300002     6233
307500     6186
301000     5977
383100     5911
428100     5859
391600     5797
419000     5715
396300     5393
402000     4560
999999     4514
348000      671
346600      341
417400      208
305700       95
Name: branch, dtype: int64

In [32]:
def Branches(b):
    if b in ['T001081','300002', '300003', '300006', '300007', '300010', '300012', '300013', '300014']:
        b = np.NAN
    elif b == '301000':
        b = 'Agriculture, forestry and fishing'
    elif b == '305700':
        b = 'Mining and quarrying'
    elif b == '307500':
        b = 'Manufacturing'
    elif b == '346600':
        b = 'Energy supply'
    elif b == '348000':
        b = 'Water supply and waste management'
    elif b == '350000':
        b = 'Construction'
    elif b == '354200':
        b = 'Wholesale and retail trade'    
    elif b == '383100':
        b = 'Transportation and storage'
    elif b == '389100':
        b = 'Accommodation and food serving'
    elif b == '391600':
        b = 'Information and communication'
    elif b == '396300':
        b = 'Financial institutions'
    elif b == '402000':
        b = 'Renting, buying, selling real estates'
    elif b == '403300':
        b = 'Other specialised business services'
    elif b == '410200':
        b = 'Renting and other business support'
    elif b == '417400':
        b = 'Public administration and services'
    elif b == '419000':
        b = 'Education' 
    elif b == '422400':
        b = 'Health and social work activities'
    elif b == '428100':
        b = 'Culture, sports and recreation'
    elif b == '435500':
        b = 'Other service activities'
    elif b == '440000':
        b = 'Activities of households'
    elif b == '440900':
        b = 'Extraterritorial organisations'
    elif b == '999999':
        b = 'Unknown'
    return b    


df['branch'] = df['branch'].apply(Branches)

In [33]:
df['branch'].value_counts()

Wholesale and retail trade               7612
Other specialised business services      7540
Health and social work activities        7051
Renting and other business support       6712
Accommodation and food serving           6594
Construction                             6474
Other service activities                 6277
Manufacturing                            6186
Agriculture, forestry and fishing        5977
Transportation and storage               5911
Culture, sports and recreation           5859
Information and communication            5797
Education                                5715
Financial institutions                   5393
Renting, buying, selling real estates    4560
Unknown                                  4514
Water supply and waste management         671
Energy supply                             341
Public administration and services        208
Mining and quarrying                       95
Name: branch, dtype: int64

In [34]:
round(df.isna().sum()/len(df),4)*100

id                         0.00
self_employment_type       0.00
branch                    41.05
person_characteristics     0.00
gender                     0.00
period                     0.00
self_empl_persons          0.00
avg_personal_income        0.00
avg_self_empl_income       0.00
dtype: float64

In [35]:
df = df.dropna()
df = df.reset_index(drop=True)

In [36]:
df['person_characteristics'].value_counts()

T009002    4017
1012600    3963
1016420    3633
1016411    3605
53800      3591
1020960    3501
53900      3419
53700      3407
1016410    3380
1021150    3207
1020950    3177
1016400    3087
1020940    3006
53500      3001
2012655    2892
1020930    2881
1021140    2790
1020920    2759
2012657    2678
1021130    2664
1020910    2631
1021060    2598
1021120    2593
1020900    2457
1021110    2435
53925      2373
1020890    2223
1020870    2161
1021100    2140
1020880    2090
1021070    1945
1016460    1881
1021090    1790
41500      1732
1021080    1558
1016520    1455
21600       767
Name: person_characteristics, dtype: int64

In [37]:
def person(p):
    if p == 'T009002':
        p = np.NAN
    else:
        return p    

df['person_characteristics'] = list(map(person, df['person_characteristics']))

In [38]:
round(df.isna().sum()/len(df),4)*100

id                        0.00
self_employment_type      0.00
branch                    0.00
person_characteristics    4.04
gender                    0.00
period                    0.00
self_empl_persons         0.00
avg_personal_income       0.00
avg_self_empl_income      0.00
dtype: float64

In [39]:
df = df.dropna()
df = df.reset_index(drop=True)

In [40]:
df

,id,self_employment_type,branch,person_characteristics,gender,period,self_empl_persons,avg_personal_income,avg_self_empl_income
0,14424,1st_category_group,"Agriculture, forestry and fishing",21600,Male,2011,1.1,31.6,18.1
1,14425,1st_category_group,"Agriculture, forestry and fishing",21600,Male,2012,1.1,33.0,18.8
2,14426,1st_category_group,"Agriculture, forestry and fishing",21600,Male,2013,1.2,34.8,18.9
3,14427,1st_category_group,"Agriculture, forestry and fishing",21600,Male,2014,1.2,29.9,18.0
4,14428,1st_category_group,"Agriculture, forestry and fishing",21600,Male,2015,1.2,28.2,17.2
...,...,...,...,...,...,...,...,...,...
95465,643183,5th_category_group,Unknown,1021150,Female,2016,5.1,12.8,7.5
95466,643184,5th_category_group,Unknown,1021150,Female,2017,5.0,13.7,7.9
95467,643185,5th_category_group,Unknown,1021150,Female,2018,5.2,14.0,8.2
95468,643186,5th_category_group,Unknown,1021150,Female,2019,3.5,15.1,10.0
95469,643187,5th_category_group,Unknown,1021150,Female,2020,3.3,15.0,10.0

### Store clean data to a .csv file

In [41]:
df.to_csv('data/self_empl_cleared.csv', index = False)

In [42]:
self_empl_cleared = df.copy()

In [43]:
self_empl_cleared

,id,self_employment_type,branch,person_characteristics,gender,period,self_empl_persons,avg_personal_income,avg_self_empl_income
0,14424,1st_category_group,"Agriculture, forestry and fishing",21600,Male,2011,1.1,31.6,18.1
1,14425,1st_category_group,"Agriculture, forestry and fishing",21600,Male,2012,1.1,33.0,18.8
2,14426,1st_category_group,"Agriculture, forestry and fishing",21600,Male,2013,1.2,34.8,18.9
3,14427,1st_category_group,"Agriculture, forestry and fishing",21600,Male,2014,1.2,29.9,18.0
4,14428,1st_category_group,"Agriculture, forestry and fishing",21600,Male,2015,1.2,28.2,17.2
...,...,...,...,...,...,...,...,...,...
95465,643183,5th_category_group,Unknown,1021150,Female,2016,5.1,12.8,7.5
95466,643184,5th_category_group,Unknown,1021150,Female,2017,5.0,13.7,7.9
95467,643185,5th_category_group,Unknown,1021150,Female,2018,5.2,14.0,8.2
95468,643186,5th_category_group,Unknown,1021150,Female,2019,3.5,15.1,10.0
95469,643187,5th_category_group,Unknown,1021150,Female,2020,3.3,15.0,10.0

### Store clean data to MySQL Workbench DB

In [44]:
tableName   = 'self_empl_cleared' # name of your final dataframe

dataFrame   = pd.DataFrame(data = df)

dbConnection    = engine.connect()

try:

    frame           = dataFrame.to_sql(tableName, dbConnection, if_exists='fail');

except ValueError as vx:

    print(vx)

except Exception as ex:   

    print(ex)

else:

    print("Table %s created successfully."%tableName);   

finally:

    dbConnection.close()

Table self_empl_cleared created successfully.